newwms_gift/src/Documents/итWMSПроверка/итWMSПроверка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSПроверка</name>
  <basedOn>Document.итWMSНаборка</basedOn>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданНаОснованиСерверногоВызова</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольБутылки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонтрольКороба</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФиксацияСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтменыЗадачи</name>
      <type>
        <types>CatalogRef.итWMS_ПричиныОтменыЗадач</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>итОснования</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
        <types>DocumentRef.итWMSНаборка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/итWMSНаборка/итWMSНаборка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>итWMSНаборка</name>
  <basedOn>Document.ЗаказПокупателя</basedOn>
  <basedOn>Document.СписаниеТоваров</basedOn>
  <registerRecords>AccumulationRegister.итТоварыВЯчейках</registerRecords>
  <attributes>
    <name>итОснование</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.итWMSПриемка</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.итWMSСтатусыСкладскихДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СнимокТабличнойЧастиДоРаспределения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияДокумента</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НеРаспределятьНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозицийНоменклатурыНаПаллете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПозицийСерииНаПаллете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РезервироватьЯчейкиЭстокады</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СозданНаОснованиСерверногоВызова</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимРезервированияБезПеремещения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Проверил</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИгнорироватьОшибкиСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимТестирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРозлива</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаОтправитель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПикинга</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>ЯчейкаПолучатель</name>
      <type>
        <types>CatalogRef.итСкладскиеЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеЗадачи</name>
      <type>
        <types>EnumRef.итWMSСостоянияЗадачТСД</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторУпаковкиПолучатель</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>172</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПричинаОтменыЗадачи</name>
      <type>
        <types>CatalogRef.итWMS_ПричиныОтменыЗадач</types>
      </type>
    </attributes>
    <attributes>
      <name>ФиксацияСтроки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзъятиеТовара</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоИзъятия</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаИсполнения</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Набран</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеютсяНеЗарезервированныеТовары</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершенияНаборки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерИсточника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Выполнен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработанЛогистом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВНаборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>итВремяНачалаПогрузкиКакВремя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>итВремяЗавершенияПогрузкиКакВремя</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <comment>(Упр)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоставки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Транзит</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаФактическойОтгрузки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СетевойНомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>90</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтменитьВсеПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтменитьРезервирование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

newwms_gift/src/Documents/итWMSПроверка/ManagerModule.bsl
Процедура СформироватьПечатнуюФорму(Ссылка,ТабличныйДокумент,СтруктураКраткогоСодежимого=Неопределено) Экспорт 
	Если СтруктураКраткогоСодежимого=Неопределено Тогда 
		СтруктураКраткогоСодежимого=Новый Структура;
	КонецЕсли;	
    Макет=ПолучитьМакет("ОбщаяИнформацияПроверки");
	СформироватьПечатнуюЗаполнениеШапки(Макет, Ссылка, ТабличныйДокумент,СтруктураКраткогоСодежимого);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(итWMSПроверкаТовары.Номенклатура) КАК Номенклатура,
		|	итWMSПроверкаТовары.ДатаРозлива,
		|	СУММА(итWMSПроверкаТовары.Количество) КАК Количество,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(итWMSПроверкаТовары.Номенклатура.ЕдиницаХраненияОстатков) КАК Ед,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(итWMSПроверкаТовары.Номенклатура.ЕдиницаИзмеренияМест) КАК ЕдМест,
		|	итWMSПроверкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент КАК ЕдиницаИзмеренияМестКоэффициент,
		|	СУММА(итWMSПроверкаТовары.Количество / ВЫБОР
		|			КОГДА ЕСТЬNULL(итWMSПроверкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент, 1) = 0
		|				ТОГДА 1
		|			ИНАЧЕ ЕСТЬNULL(итWMSПроверкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент, 1)
		|		КОНЕЦ) КАК КоличествоМест
		|ИЗ
		|	Документ.итWMSПроверка.Товары КАК итWMSПроверкаТовары
		|ГДЕ
		|	итWMSПроверкаТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSПроверкаТовары.ДатаРозлива,
		|	итWMSПроверкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(итWMSПроверкаТовары.Номенклатура),
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(итWMSПроверкаТовары.Номенклатура.ЕдиницаХраненияОстатков),
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(итWMSПроверкаТовары.Номенклатура.ЕдиницаИзмеренияМест)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(итWMSПроверкаТовары.Количество / ВЫБОР
		|			КОГДА ЕСТЬNULL(итWMSПроверкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент, 1) = 0
		|				ТОГДА 1
		|			ИНАЧЕ ЕСТЬNULL(итWMSПроверкаТовары.Номенклатура.ЕдиницаИзмеренияМест.Коэффициент, 1)
		|		КОНЕЦ) КАК КоличествоМест,
		|	СУММА(итWMSПроверкаТовары.Количество) КАК Количество,
		|	ВложенныйЗапрос.ИдентификаторУпаковки КАК КоличествоПаллет
		|ИЗ
		|	Документ.итWMSПроверка.Товары КАК итWMSПроверкаТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ итWMSПроверкаТовары.ИдентификаторУпаковки) КАК ИдентификаторУпаковки
		|		ИЗ
		|			Документ.итWMSПроверка.Товары КАК итWMSПроверкаТовары
		|		ГДЕ
		|			итWMSПроверкаТовары.Ссылка = &Ссылка) КАК ВложенныйЗапрос
		|		ПО (ИСТИНА)
		|ГДЕ
		|	итWMSПроверкаТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.ИдентификаторУпаковки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
    ТаблицаДанных=новый ТаблицаЗначений;
	ОпределитьКолонкиТаблицы(ТаблицаДанных);
	ВыборкаДетальнойЗаписи=МассивРезультатов[0].Выбрать();
	Пока ВыборкаДетальнойЗаписи.Следующий() Цикл 
		ОбластьСтрокиТовары=Макет.ПолучитьОбласть("СтрокиТовары");
		ОбластьСтрокиТовары.Параметры.Заполнить(ВыборкаДетальнойЗаписи);
		ТабличныйДокумент.Вывести(ОбластьСтрокиТовары);
		ЗаполнитьЗначенияСвойств(ТаблицаДанных.Добавить(),ВыборкаДетальнойЗаписи);
	КонецЦикла;
	СтруктураКраткогоСодежимого.Вставить("ТаблицаДанных",ТаблицаДанных);
	ВыборкаИтогов=МассивРезультатов[1].Выбрать();
	ОбластьИтогов=Макет.ПолучитьОбласть("Итого");
	Пока ВыборкаИтогов.Следующий() Цикл
		ОбластьИтогов.Параметры.КоличествоПаллет= ВыборкаИтогов.КоличествоПаллет;
		ОбластьИтогов.Параметры.КоличествоИтого=ВыборкаИтогов.Количество;
		ОбластьИтогов.Параметры.КоличествоМестИтого=ВыборкаИтогов.КоличествоМест;
		СтруктураКраткогоСодежимого.Вставить("КоличествоПаллет",ВыборкаИтогов.КоличествоПаллет);
		СтруктураКраткогоСодежимого.Вставить("КоличествоИтого",ВыборкаИтогов.Количество);
		СтруктураКраткогоСодежимого.Вставить("КоличествоМестИтого",ВыборкаИтогов.КоличествоМест);
	КонецЦикла;	
	ТабличныйДокумент.Вывести(ОбластьИтогов);
	ОбластьПодписи=Макет.ПолучитьОбласть("Подписи");
	ТабличныйДокумент.Вывести(ОбластьПодписи);
КонецПроцедуры

Процедура ОпределитьКолонкиТаблицы( ТаблицаДанных)
	
	ТаблицаДанных.Колонки.Добавить("Номенклатура");
	ТаблицаДанных.Колонки.Добавить("ДатаРозлива");
	ТаблицаДанных.Колонки.Добавить("Количество");
	ТаблицаДанных.Колонки.Добавить("Ед");
	ТаблицаДанных.Колонки.Добавить("ЕдМест");
	ТаблицаДанных.Колонки.Добавить("КоличествоМест");

КонецПроцедуры

Процедура СформироватьПечатнуюЗаполнениеШапки( Макет,  Ссылка,  ТабличныйДокумент,СтруктураКраткогоСодежимого)
	
	
	ОбластьОрганизация=Макет.ПолучитьОбласть("Организация");
	ОбластьКонтрагент=Макет.ПолучитьОбласть("Контрагент");
	ОбластьОрганизация.Параметры.Организация=Строка(Ссылка.Организация);
	ОбластьКонтрагент.Параметры.Контрагент=Строка(Ссылка.Контрагент);
	ТабличныйДокумент.Вывести(ОбластьОрганизация);
	ТабличныйДокумент.Вывести(ОбластьКонтрагент);
	ДанныеВремяДатыОтгрузки=ПолучитьДатуВремяОтгрузки(Ссылка);
	ОбластьДатаВремяОтгрузки=Макет.ПолучитьОбласть("ДатаВремяОтгрузки");
	ОбластьДатаВремяОтгрузки.Параметры.Датаотгрузки=Формат(ДанныеВремяДатыОтгрузки.ДатаОтгрузки,"ДФ=dd.MM.yyyy");
	ОбластьДатаВремяОтгрузки.Параметры.Времяотгрузки=Формат(ДанныеВремяДатыОтгрузки.ВремяПогрузки,"ДЛФ=T");
	ОбластьШапкиТовары=Макет.ПолучитьОбласть("ШапкаТовары");
	ТабличныйДокумент.Вывести(ОбластьДатаВремяОтгрузки);
	ТабличныйДокумент.Вывести(ОбластьШапкиТовары);
	СтруктураКраткогоСодежимого.Вставить("Организация",Строка(Ссылка.Организация));
    СтруктураКраткогоСодежимого.Вставить("Контрагент",Строка(Ссылка.Контрагент));
    СтруктураКраткогоСодежимого.Вставить("Датаотгрузки",ДанныеВремяДатыОтгрузки.ДатаОтгрузки);
    СтруктураКраткогоСодежимого.Вставить("ВремяПогрузки",ДанныеВремяДатыОтгрузки.ВремяПогрузки);
КонецПроцедуры


Функция ПолучитьДатуВремяОтгрузки(Ссылка)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	итWMSПроверкаитОснования.Документ
		|ПОМЕСТИТЬ ВТНаборки
		|ИЗ
		|	Документ.итWMSПроверка.итОснования КАК итWMSПроверкаитОснования
		|ГДЕ
		|	итWMSПроверкаитОснования.Ссылка = &Ссылка
		|	И ТИПЗНАЧЕНИЯ(итWMSПроверкаитОснования.Документ) = ТИП(Документ.итwmsНаборка)
		|
		|СГРУППИРОВАТЬ ПО
		|	итWMSПроверкаитОснования.Документ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	итWMSНаборка.итОснование КАК Заказ
		|ПОМЕСТИТЬ ВтЗаказПокупателя
		|ИЗ
		|	ВТНаборки КАК ВТНаборки
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.итWMSНаборка КАК итWMSНаборка
		|		ПО ВТНаборки.Документ = итWMSНаборка.Ссылка
		|ГДЕ
		|	ТИПЗНАЧЕНИЯ(итWMSНаборка.итОснование) = ТИП(Документ.ЗаказПокупателя)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЗаказПокупателя.ДатаОтгрузки) КАК ДатаОтгрузки,
		|	МАКСИМУМ(ЗаказПокупателя.итВремяНачалаПогрузкиКакВремя) КАК итВремяНачалаПогрузкиКакВремя
		|ПОМЕСТИТЬ ДатаВремяНачалаОтгрузки
		|ИЗ
		|	ВтЗаказПокупателя КАК ВтЗаказПокупателя
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПокупателя КАК ЗаказПокупателя
		|		ПО ВтЗаказПокупателя.Заказ = ЗаказПокупателя.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ДатаВремяНачалаОтгрузки.ДатаОтгрузки, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаОтгрузки,
		|	ЕСТЬNULL(ДатаВремяНачалаОтгрузки.итВремяНачалаПогрузкиКакВремя, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ВремяПогрузки
		|ИЗ
		|	ДатаВремяНачалаОтгрузки КАК ДатаВремяНачалаОтгрузки";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
    СтруктураОтвета=новый Структура;
	СтруктураОтвета.Вставить("ДатаОтгрузки",'00010101');
	СтруктураОтвета.Вставить("ВремяПогрузки",'00010101');
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураОтвета.ДатаОтгрузки=ВыборкаДетальныеЗаписи.ДатаОтгрузки;
		СтруктураОтвета.ВремяПогрузки=ВыборкаДетальныеЗаписи.ВремяПогрузки;
	КонецЦикла;
	
	Возврат СтруктураОтвета;	
	КонецФункции
	
	
Процедура ВнестиИзменениеДанныхТСДВДокумент(Документ) Экспорт 
	итWMSОбработчикДанныхПроверки.ВнестиИзмененияВДокументПроверки(Документ);
КонецПроцедуры
